app/views/posts/new.html.erb

    <br/>
    <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name %>
---
SELECT "tags".* FROM "tags"