app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "a new post"], ["content", "with some new content"], ["created_at", "2015-07-07 14:42:50.685317"], ["updated_at", "2015-07-07 14:42:50.685317"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "with some better content"], ["updated_at", "2015-07-07 14:46:03.699098"], ["id", 4]]